verilog_defaults -add -Irtl/include
read_verilog -sv -Irtl/include rtl/include/npu_defines.svh
read_verilog -sv -Irtl/include rtl/npu/dma/npu_dma.sv
read_verilog -sv -Irtl/include rtl/interconnect/axi_dma_wrapper.sv
hierarchy -top npu_dma
proc
opt
stat -width
stat -tech cmos
